Revit 2027 API
ElementArray.Item Property
Gets or sets an element at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual Element this[
	int index
] { get; set; }
Public Overridable Property Item (
	index As Integer
) As Element
	Get
	Set
public:
virtual property Element^ Item[int index] {
	Element^ get (int index);
	void set (int index, Element^ value);
}
abstract Item : Element with get, set
override Item : Element with get, set
Parameters
index Int32
The index of the element to be set or retrieved.
Return Value
Element
Returns the element at the specified index.
See Also
Reference
ElementArray Class
Autodesk.Revit.DB Namespace